{
  "allow-flight": "Позволяет пользователям использовать полет на сервере в режиме выживания, если у них установлен мод, обеспечивающий полет. <br><br>false - Полет запрещен (игрока, находящегося в воздухе не менее 5 секунд, кикает).<br>true — полет разрешен и используется, если у игрока установлен мод полета.",
  "allow-nether": "Позволяет игрокам путешествовать в Нижний мир.<br>false — порталы в Нижний мир не работают.<br>true — сервер позволяет порталам отправлять игроков в Нижний мир.",
  "broadcast-console-to-ops": "Отправка выводов консольных команд всем онлайн-операторам.",
  "broadcast-rcon-to-ops": "Отправьте выходные данные консольной команды rcon всем онлайн-операторам.",
  "difficulty": "Определяет сложность (например, урон, наносимый мобами, и то, как голод и яд влияют на игроков) сервера. Если указан устаревший номер сложности, он автоматически преобразуется в имя сложности.<br><br>мирный (0)<br>легко (1)<br>нормальный (2)<br>жесткий (3)",
  "enable-command-block": "Включает командные блоки",
  "enable-jmx-monitoring": "Предоставляет MBean с именем объекта net.minecraft.server:type=Server и двумя атрибутами mediumTickTime и tickTimes, отображающими время тиков в миллисекундах. Чтобы включить JMX в среде выполнения Java, вам также необходимо добавить пару флагов JVM в ",
  "enable-rcon": "Разрешает удаленный доступ к консоли сервера. Не рекомендуется выставлять RCON в Интернет, так как протокол RCON передает все без шифрования. ",
  "enable-status": "Отображает сервер как онлайн в списке серверов. Если установлено значение false, он будет подавлять ответы от клиентов. ",
  "enable-query": "Включает прослушиватель сервера протокола GameSpy4. ",
  "enforce-secure-profile": "Если установлено значение true, игроки без открытого ключа, подписанного Mojang, не смогут подключиться к серверу.",
  "enforce-whitelist": "Применяет белый список на сервере. Если эта опция включена, пользователи, которых нет в белом списке (если он включен), удаляются с сервера после того, как сервер перезагрузит файл белого списка.<br><br>false — ни один пользователь не будет исключен, если его нет в белом списке.<br>true — онлайн-пользователи, не входящие в белый список, удаляются.",
  "entity-broadcast-range-percentage": "Управляет тем, насколько близко объекты должны быть перед отправкой клиентам. ",
  "force-gamemode": "Заставить игроков присоединиться в игровом режиме по умолчанию.false — игроки присоединяются в игровом режиме, в котором они остались.<br>true — игроки всегда присоединяются в игровом режиме по умолчанию.",
  "function-permission-level": "Устанавливает уровень разрешений по умолчанию для функций. Подробную информацию о 4 уровнях см. в разделе Уровень разрешений.",
  "gamemode": "Определяет режим игры. Если указан устаревший номер режима игры, он автоматически преобразуется в имя режима игры.<br>выживание (0)<br>креатив (1)<br>приключение (2)<br>зритель (3)",
  "generate-structures": "Определяет, могут ли создаваться структуры (например, деревни). false — структуры не генерируются в новых фрагментах.<br>true — структуры генерируются в новых фрагментах.<br>Примечание. Подземелья по-прежнему генерируются, если для этого параметра установлено значение false.",
  "generator-settings": "Настройки, используемые для настройки генерации мира. ",
  "hardcore": "Если установлено значение true, сложность сервера игнорируется и устанавливается на высокую, а игроки переходят в режим зрителя, если они умирают.",
  "hide-online-players": "Если установлено значение true, список игроков не отправляется в запросах статуса.",
  "initial-disabled-packs": "Разделенный запятыми список пакетов данных, которые не будут автоматически включаться при создании мира.",
  "initial-enabled-packs": "Разделенный запятыми список пакетов данных, которые будут включены во время создания мира. ",
  "level-name": "Значение level-name используется как имя мира и имя его папки. ",
  "level-seed": "Устанавливает семя мира для мира игрока, как в одиночной игре. ",
  "level-type": "Определяет сгенерированный пресет мира. Экранирование требуется при использовании идентификатора предустановки мира, а пространство имен идентификатора пресета ванильного мира (minecraft:) можно опустить.<br><br>minecraft:normal - Стандартный мир с холмами, долинами, водой и т.д.<br>minecraft:flat — плоский мир без каких-либо особенностей, который можно изменить с помощью настроек генератора.<br>minecraft:large_biomes — то же, что и по умолчанию, но все биомы больше.<br>minecraft:amplified — то же, что и по умолчанию, но увеличен предел высоты генерации мира.<br>minecraft:single_biome_surface — мир буфета, в котором весь верхний мир состоит из одного биома, может быть изменен с помощью настроек генератора.<br>шведский стол - Только в 1.15 или ранее. <br>default_1_1 — только для версии 1.15 или ранее. <br>настроенный - только для 1.15 или ранее. ",
  "max-chained-neighbor-updates": "Ограничение количества последовательных обновлений соседей перед пропуском дополнительных. ",
  "max-players": "Максимальное количество игроков, которые могут играть на сервере одновременно. ",
  "max-tick-time": "Максимальное количество миллисекунд, которое может пройти один тик, прежде чем сторожевой таймер сервера остановит сервер с сообщением. Один тик сервера занял 60,00 секунд (должно быть не более 0,05); ",
  "max-world-size": "Это устанавливает максимально возможный размер в блоках, выраженный в виде радиуса, который может получить граница мира.  <br><br>Установка max-world-size на 1000 позволяет игроку иметь границу мира размером 2000×2000.<br>Установка max-world-size на 4000 дает игроку мировую границу размером 8000×8000.",
  "motd": "Это сообщение отображается в списке серверов клиента под именем. MOTD поддерживает коды цвета и форматирования.<br>MOTD поддерживает специальные символы, такие как сердца. <br>Если MOTD превышает 59 символов, список серверов может сообщать об ошибке связи.",
  "network-compression-threshold": "По умолчанию он позволяет пакетам размером n-1 байт проходить нормально, но пакет из n байтов или более сжимается. <br>0 - сжать все<br>Примечание. Спецификация Ethernet требует, чтобы пакеты размером менее 64 байт дополнялись до 64 байт. ",
  "online-mode": "Сервер проверяет подключающихся игроков по базе учетных записей Minecraft. <br>false - отключено. ",
  "op-permission-level": "Устанавливает уровень разрешений по умолчанию для операций при использовании /op.",
  "player-idle-timeout": "Если не ноль, игроки удаляются с сервера, если они бездействуют более указанного количества минут. Примечание. Время простоя сбрасывается, когда сервер получает один из следующих пакетов:<br>Нажмите Окно<br>Зачаровать предмет<br>Знак обновления<br>Копание игрока<br>Размещение блока игрока<br>Задержанное изменение предмета<br>Анимация (поворотная рука)<br>Действие объекта<br>Статус клиента<br>Сообщение чата<br>Использовать сущность",
  "prevent-proxy-connections": "Если ISP/AS, отправленный с сервера, отличается от сервера аутентификации Mojang Studios, игрок будет исключен.",
  "previews-chat": "Если установлено значение true, предварительный просмотр чата будет включен.true — включен. <br>false - отключено.",
  "pvp": "Включить PvP на сервере. <br>false — игроки не могут убивать других игроков (также известный как игрок против окружающей среды (PvE)).<br>Примечание. Косвенные источники урона, создаваемые игроками (такие как лава, огонь, TNT и в некоторой степени вода, песок и гравий), по-прежнему наносят урон другим игрокам.",
  "query.port": "Устанавливает порт для сервера запросов (см. enable-query).",
  "rate-limit": "Устанавливает максимальное количество пакетов, которые пользователь может отправить, прежде чем его кикают. ",
  "rcon.password": "Устанавливает пароль для RCON: протокол удаленной консоли, который позволяет другим приложениям подключаться и взаимодействовать с сервером Minecraft через Интернет.",
  "rcon.port": "Устанавливает сетевой порт RCON.",
  "resource-pack": "Необязательный URI для пакета ресурсов. ",
  "resource-pack-prompt": "Необязательно, добавляет пользовательское сообщение, которое будет отображаться в приглашении пакета ресурсов, когда используется пакет ресурсов. Ожидает синтаксис компонента чата, может содержать несколько строк.",
  "resource-pack-sha1": "Необязательный дайджест SHA-1 пакета ресурсов в шестнадцатеричном формате нижнего регистра. ",
  "require-resource-pack": "Когда этот параметр включен (установлен в значение true), игрокам будет предложено ответить, и они будут отключены, если откажутся от требуемого пакета.",
  "server-ip": "Игрок должен установить это, если он хочет, чтобы сервер привязывался к определенному IP-адресу. ",
  "server-port": "Изменяет порт, на котором хостится (прослушивается) сервер. ",
  "simulation-distance": "Устанавливает максимальное расстояние от игроков, на котором могут находиться живые существа для обновления сервером, измеряемое кусками в каждом направлении от игрока (радиус, а не диаметр). ",
  "snooper-enabled": "Определяет, будет ли сервер регулярно отправлять данные отслеживания на http://snoop.minecraft.net.<br>false - отключить отслеживание.<br>true - включить отслеживание.",
  "spawn-animals": "Определяет, могут ли животные появляться. true — животные появляются как обычно.<br>false - Животные немедленно исчезают.<br>Если у плеера сильное отставание, рекомендуется выключить/установить значение false.",
  "spawn-monsters": "Определяет, могут ли появляться монстры. true — включено. <br>false - отключено. <br>Этот параметр не действует, если сложность = 0 (мирный). <br>Если у плеера сильное отставание, рекомендуется выключить/установить значение false.",
  "spawn-npcs": "Определяет, могут ли сельские жители появляться. true — Enabled. <br>false - отключено. ",
  "spawn-protection": "Определяет длину стороны квадратной области защиты от спавна как 2x 1. Установка этого параметра на 0 отключает защиту от спауна. ",
  "sync-chunk-writes": "Включает синхронную запись фрагментов.",
  "use-native-transport": "Улучшения производительности сервера Linux: оптимизирована отправка/получение пакетов в Linuxtrue — включено. <br>false - отключено. ",
  "view-distance": "Устанавливает количество данных о мире, которые сервер отправляет клиенту, измеренное в кусках в каждом направлении от игрока (радиус, а не диаметр). ",
  "white-list": "Включает белый список на сервере. При включенном белом списке пользователи, не входящие в белый список, не могут подключиться. <br><br>false — белый список не используется.<br>true — файл whitelist.json используется для создания белого списка.<br>Примечание. Операторы автоматически заносятся в белый список, и их не нужно добавлять в белый список."
}