{
  "allow-flight": "Hiermee kunnen gebruikers vluchten op de server gebruiken terwijl ze in de overlevingsmodus zijn, als ze een mod hebben geïnstalleerd die vluchten mogelijk maakt. Als toestaan-vluchten is ingeschakeld, kunnen griefers vaker voorkomen, omdat het hun werk gemakkelijker maakt. <br><br>false - Vluchten is niet toegestaan (spelers die minstens 5 seconden in de lucht zijn, worden geschopt).<br>true - Vliegen is toegestaan en wordt gebruikt als de speler een vliegmod heeft geïnstalleerd.",
  "allow-nether": "Hiermee kunnen spelers naar de Nether reizen.false - Netherportalen werken niet.<br>true - De server staat portals toe om spelers naar de Nether te sturen.",
  "broadcast-console-to-ops": "Stuur console-opdrachtuitvoer naar alle online operators.",
  "broadcast-rcon-to-ops": "Stuur rcon console-opdrachtuitvoer naar alle online operators.",
  "difficulty": "Definieert de moeilijkheidsgraad (zoals schade toegebracht door mobs en de manier waarop honger en vergif spelers beïnvloeden) van de server.<br><br>rustig (0)<br>makkelijk (1)<br>normaal (2)<br>moeilijk (3)",
  "enable-command-block": "Schakelt opdrachtblokken in",
  "enable-jmx-monitoring": "Toont een MBean met de objectnaam net.minecraft.server:type=Server en twee attributen averageTickTime en tickTimes die de tiktijden in milliseconden blootleggen. Om JMX op de Java-runtime in te schakelen, moet u ook een paar JVM-vlaggen toevoegen aan de ",
  "enable-rcon": "Maakt externe toegang tot de serverconsole mogelijk. Het wordt niet aanbevolen om RCON bloot te stellen aan internet, omdat het RCON-protocol alles zonder codering overdraagt. ",
  "enable-status": "Zorgt ervoor dat de server als online wordt weergegeven in de serverlijst. Indien ingesteld op false, worden antwoorden van clients onderdrukt. ",
  "enable-query": "Schakelt de luisteraar van de GameSpy4-protocolserver in. ",
  "enforce-secure-profile": "Indien ingesteld op waar, kunnen spelers zonder een door Mojang ondertekende openbare sleutel geen verbinding maken met de server.",
  "enforce-whitelist": "Dwingt de whitelist op de server af. Wanneer deze optie is ingeschakeld, worden gebruikers die niet op de whitelist staan (als deze is ingeschakeld) van de server verwijderd nadat de server het whitelist-bestand opnieuw heeft geladen.<br><br>false - Geen enkele gebruiker wordt gekickt als hij niet op de witte lijst staat.<br>waar - Online gebruikers die niet op de witte lijst staan, worden geschopt.",
  "entity-broadcast-range-percentage": "Bepaalt hoe dichtbij entiteiten moeten zijn voordat ze naar clients worden verzonden. ",
  "force-gamemode": "Dwing spelers om mee te doen in de standaard spelmodus.false - Spelers doen mee in de spelmodus waarin ze gebleven waren.<br>true - Spelers doen altijd mee in de standaard gamemode.",
  "function-permission-level": "Stelt het standaard machtigingsniveau in voor functies. Zie machtigingsniveau voor details over de 4 niveaus.",
  "gamemode": "Definieert de spelmodus. Als een oud gamemode-nummer is opgegeven, wordt dit geruisloos omgezet in een gamemode-naam.<br>overleving (0)<br>creatief (1)<br>avontuur (2)<br>toeschouwer (3)",
  "generate-structures": "Definieert of structuren (zoals dorpen) kunnen worden gegenereerd.false - Structuren worden niet in nieuwe blokken gegenereerd.<br>true - Structuren worden gegenereerd in nieuwe chunks.<br>Opmerking: Dungeons worden nog steeds gegenereerd als dit is ingesteld op false.",
  "generator-settings": "De instellingen die worden gebruikt om wereldgeneratie aan te passen. ",
  "hardcore": "Indien ingesteld op waar, wordt de servermoeilijkheid genegeerd en ingesteld op moeilijk en worden spelers ingesteld op toeschouwersmodus als ze doodgaan.",
  "hide-online-players": "Indien ingesteld op waar, wordt er geen spelerslijst verzonden op statusverzoeken.",
  "initial-disabled-packs": "Door komma's gescheiden lijst met datapacks die niet automatisch worden ingeschakeld bij het maken van een wereld.",
  "initial-enabled-packs": "Door komma's gescheiden lijst met datapacks die moeten worden ingeschakeld tijdens het maken van de wereld. ",
  "level-name": "De level-name waarde wordt gebruikt als de wereldnaam en de mapnaam. ",
  "level-seed": "Stelt een wereldzaad in voor de wereld van de speler, zoals in Singleplayer. ",
  "level-type": "Bepaalt de wereldvoorinstelling die wordt gegenereerd. Escaping is vereist bij gebruik van een wereldvoorinstelling-ID, en de naamruimte van de vanilla wereldvoorinstelling-ID (minecraft:) kan worden weggelaten.<br><br>minecraft:normal - Standaardwereld met heuvels, valleien, water, enz.<br>minecraft:flat - Een platte wereld zonder functies, kan worden aangepast met generatorinstellingen.<br>minecraft:large_biomes - Hetzelfde als standaard, maar alle biomen zijn groter.<br>minecraft:amplified - Hetzelfde als standaard, maar de hoogtelimiet voor de wereldgeneratie is verhoogd.<br>minecraft:single_biome_surface - Een buffetwereld waarvan de hele bovenwereld uit één bioom bestaat, kan worden aangepast met generator-instellingen.<br>buffet - Alleen voor 1.15 of eerder. <br>default_1_1 - Alleen voor 1.15 of eerder. <br>aangepast - Alleen voor 1.15 of eerder. ",
  "max-chained-neighbor-updates": "Beperking van het aantal opeenvolgende burenupdates voordat extra updates worden overgeslagen. ",
  "max-players": "Het maximale aantal spelers dat tegelijkertijd op de server kan spelen. ",
  "max-tick-time": "Het maximale aantal milliseconden dat een enkele tik mag duren voordat de serverwaakhond de server met het bericht stopt. Een enkele servertik duurde 60,00 seconden (zou maximaal 0,05 moeten zijn); ",
  "max-world-size": "Dit stelt de maximaal mogelijke grootte in blokken in, uitgedrukt als een straal, die de wereldgrens kan krijgen.  <br><br>Door de maximale wereldgrootte in te stellen op 1000, kan de speler een wereldgrens van 2000 × 2000 hebben.<br>Door de maximale wereldgrootte in te stellen op 4000, krijgt de speler een wereldgrens van 8000 x 8000.",
  "motd": "Dit is het bericht dat wordt weergegeven in de serverlijst van de client, onder de naam. De MOTD ondersteunt kleur- en opmaakcodes.<br>De MOTD ondersteunt speciale tekens, zoals hartjes. <br>Als de MOTD langer is dan 59 tekens, kan de serverlijst een communicatiefout melden.",
  "network-compression-threshold": "Standaard staat het toe dat pakketten die n-1 bytes groot zijn normaal gaan, maar een pakket van n bytes of meer wordt gecomprimeerd. <br>0 - comprimeer alles<br>Opmerking: de Ethernet-specificatie vereist dat pakketten van minder dan 64 bytes worden opgevuld tot 64 bytes. ",
  "online-mode": "De server controleert het verbinden van spelers met de Minecraft-accountdatabase. <br>false - Uitgeschakeld. ",
  "op-permission-level": "Stelt het standaard machtigingsniveau in voor ops bij gebruik van /op.",
  "player-idle-timeout": "Indien niet nul, worden spelers van de server geschopt als ze langer dan dat aantal minuten inactief zijn. Opmerking: de inactieve tijd wordt gereset wanneer de server een van de volgende pakketten ontvangt:<br>Klik op Venster<br>Betoverend item<br>Teken bijwerken<br>Speler graven<br>Plaatsing van spelersblokken<br>Wijziging vastgehouden item<br>Animatie (zwaaiarm)<br>Entiteit actie<br>Cliëntstatus<br>Chatbericht<br>Gebruik Entiteit",
  "prevent-proxy-connections": "Als de ISP/AS die vanaf de server wordt verzonden, verschilt van die van de authenticatieserver van Mojang Studios, wordt de speler gekickt.",
  "previews-chat": "Indien ingesteld op true, wordt chatvoorbeeld ingeschakeld.true - ingeschakeld. <br>false - Uitgeschakeld.",
  "pvp": "Schakel PvP in op de server. <br>false - Spelers kunnen andere spelers niet doden (ook bekend als Player versus Environment (PvE)).<br>Opmerking: indirecte schadebronnen die door spelers zijn voortgebracht (zoals lava, vuur, TNT en tot op zekere hoogte water, zand en grind) brengen nog steeds schade toe aan andere spelers.",
  "query.port": "Stelt de poort in voor de queryserver (zie enable-query).",
  "rate-limit": "Stelt het maximale aantal pakketten in dat een gebruiker kan verzenden voordat hij wordt getrapt. ",
  "rcon.password": "Stelt het wachtwoord in voor RCON: een remote console-protocol waarmee andere toepassingen via internet verbinding kunnen maken met en communiceren met een Minecraft-server.",
  "rcon.port": "Stelt de RCON-netwerkpoort in.",
  "resource-pack": "Optionele URI naar een resource pack. ",
  "resource-pack-prompt": "Optioneel, voegt een aangepast bericht toe dat moet worden weergegeven op de resource pack-prompt wanneer vereist-resource-pack wordt gebruikt. Verwacht syntaxis van chatcomponenten, kan meerdere regels bevatten.",
  "resource-pack-sha1": "Optionele SHA-1 samenvatting van het resource pack, in hexadecimale kleine letters. ",
  "require-resource-pack": "Als deze optie is ingeschakeld (ingesteld op waar), wordt spelers om een reactie gevraagd en wordt de verbinding verbroken als ze het vereiste pakket weigeren.",
  "server-ip": "De speler moet dit instellen als hij wil dat de server zich aan een bepaald IP-adres bindt. ",
  "server-port": "Wijzigt de poort waarop de server host (luistert). ",
  "simulation-distance": "Stelt de maximale afstand van spelers in waarop levende wezens zich mogen bevinden om door de server te worden bijgewerkt, gemeten in stukjes in elke richting van de speler (straal, niet diameter). ",
  "snooper-enabled": "Stelt in of de server regelmatig snoopgegevens naar http://snoop.minecraft.net stuurt.<br>false - snuffelen uitschakelen.<br>true - snuffelen inschakelen.",
  "spawn-animals": "Bepaalt of dieren kunnen spawnen.true - Dieren spawnen zoals normaal.<br>false - Dieren verdwijnen onmiddellijk.<br>Als de speler een grote vertraging heeft, is het raadzaam om dit uit te zetten/in te stellen op false.",
  "spawn-monsters": "Bepaalt of monsters kunnen spawnen.true - Ingeschakeld. <br>false - Uitgeschakeld. <br>Deze instelling heeft geen effect als moeilijkheidsgraad = 0 (rustig). <br>Als de speler een grote vertraging heeft, is het raadzaam om dit uit te zetten/in te stellen op false.",
  "spawn-npcs": "Bepaalt of dorpelingen kunnen spawnen.true - Ingeschakeld. <br>false - Uitgeschakeld. ",
  "spawn-protection": "Bepaalt de zijlengte van het vierkante spawn-beschermingsgebied als 2x 1. Als u dit op 0 zet, wordt de spawn-bescherming uitgeschakeld. ",
  "sync-chunk-writes": "Maakt synchrone chunk-schrijfbewerkingen mogelijk.",
  "use-native-transport": "Prestatieverbeteringen Linux-server: geoptimaliseerd verzenden/ontvangen van pakketten op Linuxtrue - Ingeschakeld. <br>false - Uitgeschakeld. ",
  "view-distance": "Stelt de hoeveelheid wereldgegevens in die de server naar de client stuurt, gemeten in brokken in elke richting van de speler (straal, niet diameter). ",
  "white-list": "Schakelt een witte lijst op de server in. Als een witte lijst is ingeschakeld, kunnen gebruikers die niet op de witte lijst staan geen verbinding maken. <br><br>false - Er wordt geen witte lijst gebruikt.<br>true - Het bestand whitelist.json wordt gebruikt om de witte lijst te genereren.<br>Opmerking: Ops worden automatisch op de witte lijst gezet en het is niet nodig om ze aan de witte lijst toe te voegen."
}