{
  "allow-flight": "Allows users to use flight on the server while in Survival mode, if they have a mod that provides flight installed.With allow-flight enabled, griefers may become more common, because it makes their work easier. In Creative mode, this has no effect.<br><br>false - Flight is not allowed (players in air for at least 5 seconds get kicked).<br>true - Flight is allowed, and used if the player has a fly mod installed.",
  "allow-nether": "Allows players to travel to the Nether.false - Nether portals do not work.<br>true - The server allows portals to send players to the Nether.",
  "broadcast-console-to-ops": "Send console command outputs to all online operators.",
  "broadcast-rcon-to-ops": "Send rcon console command outputs to all online operators.",
  "difficulty": "Defines the difficulty (such as damage dealt by mobs and the way hunger and poison affects players) of the server.If a legacy difficulty number is specified, it is silently converted to a difficulty name.<br><br>peaceful (0)<br>easy (1)<br>normal (2)<br>hard (3)",
  "enable-command-block": "Enables command blocks",
  "enable-jmx-monitoring": "Exposes an MBean with the Object name net.minecraft.server:type=Server and two attributes averageTickTime and tickTimes exposing the tick times in milliseconds.In order for enabling JMX on the Java runtime you also need to add a couple of JVM flags to the startup as documented here.",
  "enable-rcon": "Enables remote access to the server console.It's not recommended to expose RCON to the Internet, because RCON protocol transfers everything without encryption. Everything (including RCON password) communicated between the RCON server and client can be leaked to someone listening in on your connection.",
  "enable-status": "Makes the server appear as online on the server list.If set to false, it will suppress replies from clients. This means it will appear as offline, but will still accept connections.",
  "enable-query": "Enables GameSpy4 protocol server listener. Used to get information about server.",
  "enforce-secure-profile": "If set to true, players without a Mojang-signed public key will not be able to connect to the server.",
  "enforce-whitelist": "Enforces the whitelist on the server.When this option is enabled, users who are not present on the whitelist (if it's enabled) get kicked from the server after the server reloads the whitelist file.<br><br>false - No user gets kicked if not on the whitelist.<br>true - Online users not on the whitelist get kicked.",
  "entity-broadcast-range-percentage": "Controls how close entities need to be before being sent to clients. Higher values means they'll be rendered from farther away, potentially causing more lag. This is expressed the percentage of the default value. For example, setting to 50 will make it half as usual. This mimics the function on the client video settings (not unlike Render Distance, which the client can customize so long as it's under the server's setting).",
  "force-gamemode": "Force players to join in the default game mode.false - Players join in the gamemode they left in.<br>true - Players always join in the default gamemode.",
  "function-permission-level": "Sets the default permission level for functions.See permission level for the details on the 4 levels.",
  "gamemode": "Defines the mode of gameplay.If a legacy gamemode number is specified, it is silently converted to a gamemode name.<br>survival (0)<br>creative (1)<br>adventure (2)<br>spectator (3)",
  "generate-structures": "Defines whether structures (such as villages) can be generated.false - Structures are not generated in new chunks.<br>true - Structures are generated in new chunks.<br>Note: Dungeons still generate if this is set to false.",
  "generator-settings": "The settings used to customize world generation. Follow its format and write the corresponding JSON string.",
  "hardcore": "If set to true, server difficulty is ignored and set to hard and players are set to spectator mode if they die.",
  "hide-online-players": "If set to true, a player list is not sent on status requests.",
  "initial-disabled-packs": "Comma-separated list of datapacks to not be auto-enabled on world creation.",
  "initial-enabled-packs": "Comma-separated list of datapacks to be enabled during world creation. Feature packs need to be explicitly enabled.",
  "level-name": "The level-name value is used as the world name and its folder name. The player may also copy their saved game folder here, and change the name to the same as that folder's to load it instead.Characters such as ' (apostrophe) may need to be escaped by adding a backslash before them.",
  "level-seed": "Sets a world seed for the player's world, as in Singleplayer. The world generates with a random seed if left blank.Some examples are: minecraft, 404, 1a2b3c.",
  "level-type": "Determines the world preset that is generated.Escaping is required when using a world preset ID, and the vanilla world preset ID's namespace (minecraft:) can be omitted.<br><br>minecraft:normal - Standard world with hills, valleys, water, etc.<br>minecraft:flat - A flat world with no features, can be modified with generator-settings.<br>minecraft:large_biomes - Same as default but all biomes are larger.<br>minecraft:amplified - Same as default but world-generation height limit is increased.<br>minecraft:single_biome_surface - A buffet world which the entire overworld consists of one biome, can be modified with generator-settings.<br>buffet - Only for 1.15 or before. Same as default unless generator-settings is set.<br>default_1_1 - Only for 1.15 or before. Same as default, but counted as a different world type.<br>customized - Only for 1.15 or before. After 1.13, this value is no different than default, but in 1.12 and before, it could be used to create a completely custom world.",
  "max-chained-neighbor-updates": "Limiting the amount of consecutive neighbor updates before skipping additional ones. Negative values remove the limit.",
  "max-players": "The maximum number of players that can play on the server at the same time. Note that more players on the server consume more resources. Note also, op player connections are not supposed to count against the max players, but ops currently cannot join a full server. However, this can be changed by going to the file called ops.json in the player's server directory, opening it, finding the op that the player wants to change, and changing the setting called bypassesPlayerLimit to true (the default is false). This means that that op does not have to wait for a player to leave in order to join. Extremely large values for this field result in the client-side user list being broken.",
  "max-tick-time": "The maximum number of milliseconds a single tick may take before the server watchdog stops the server with the message, A single server tick took 60.00 seconds (should be max 0.05); Considering it to be crashed, server will forcibly shutdown. Once this criterion is met, it calls System.exit(1).-1 - disable watchdog entirely (this disable option was added in 14w32a)",
  "max-world-size": "This sets the maximum possible size in blocks, expressed as a radius, that the world border can obtain. Setting the world border bigger causes the commands to complete successfully but the actual border does not move past this block limit. Setting the max-world-size higher than the default doesn't appear to do anything.Examples: <br><br>Setting max-world-size to 1000 allows the player to have a 2000×2000 world border.<br>Setting max-world-size to 4000 gives the player an 8000×8000 world border.",
  "motd": "This is the message that is displayed in the server list of the client, below the name.The MOTD supports color and formatting codes.<br>The MOTD supports special characters, such as hearts. However, such characters must be converted to escaped Unicode form. An online converter can be found here.<br>If the MOTD is over 59 characters, the server list may report a communication error.",
  "network-compression-threshold": "By default it allows packets that are n-1 bytes big to go normally, but a packet of n bytes or more gets compressed down. So, a lower number means more compression but compressing small amounts of bytes might actually end up with a larger result than what went in.-1 - disable compression entirely<br>0 - compress everything<br>Note: The Ethernet spec requires that packets less than 64 bytes become padded to 64 bytes. Thus, setting a value lower than 64 may not be beneficial. It is also not recommended to exceed the MTU, typically 1500 bytes.",
  "online-mode": "Server checks connecting players against Minecraft account database. Set this to false only if the player's server is not connected to the Internet. Hackers with fake accounts can connect if this is set to false! If minecraft.net is down or inaccessible, no players can connect if this is set to true. Setting this variable to off purposely is called cracking a server, and servers that are present with online mode off are called cracked servers, allowing players with unlicensed copies of Minecraft to join.true - Enabled. The server assumes it has an Internet connection and checks every connecting player.<br>false - Disabled. The server does not attempt to check connecting players.",
  "op-permission-level": "Sets the default permission level for ops when using /op.",
  "player-idle-timeout": "If non-zero, players are kicked from the server if they are idle for more than that many minutes.Note: Idle time is reset when the server receives one of the following packets:<br>Click Window<br>Enchant Item<br>Update Sign<br>Player Digging<br>Player Block Placement<br>Held Item Change<br>Animation (swing arm)<br>Entity Action<br>Client Status<br>Chat Message<br>Use Entity",
  "prevent-proxy-connections": "If the ISP/AS sent from the server is different from the one from Mojang Studios' authentication server, the player is kicked.",
  "previews-chat": "If set to true, chat preview will be enabled.true - Enabled. When enabled, a server-controlled preview appears above the chat edit box, showing how the message will look when sent.<br>false - Disabled.",
  "pvp": "Enable PvP on the server. Players shooting themselves with arrows receive damage only if PvP is enabled.true - Players can kill each other.<br>false - Players cannot kill other players (also known as Player versus Environment (PvE)).<br>Note: Indirect damage sources spawned by players (such as lava, fire, TNT and to some extent water, sand and gravel) still deal damage to other players.",
  "query.port": "Sets the port for the query server (see enable-query).",
  "rate-limit": "Sets the maximum amount of packets a user can send before getting kicked. Setting to 0 disables this feature.",
  "rcon.password": "Sets the password for RCON: a remote console protocol that can allow other applications to connect and interact with a Minecraft server over the internet.",
  "rcon.port": "Sets the RCON network port.",
  "resource-pack": "Optional URI to a resource pack. The player may choose to use it.Note that (in some versions before 1.15.2), Note that download success or failure is logged by the client, and not by the server.",
  "resource-pack-prompt": "Optional, adds a custom message to be shown on resource pack prompt when require-resource-pack is used.Expects chat component syntax, can contain multiple lines.",
  "resource-pack-sha1": "Optional SHA-1 digest of the resource pack, in lowercase hexadecimal. It is recommended to specify this, because it is used to verify the integrity of the resource pack.",
  "require-resource-pack": "When this option is enabled (set to true), players will be prompted for a response and will be disconnected if they decline the required pack.",
  "server-ip": "The player should set this if they want the server to bind to a particular IP. It is strongly recommended that the player leaves server-ip blank.Set to blank, or the IP the player want their server to run (listen) on.",
  "server-port": "Changes the port the server is hosting (listening) on. This port must be forwarded if the server is hosted in a network using NAT (if the player has a home router/firewall).",
  "simulation-distance": "Sets the maximum distance from players that living entities may be located in order to be updated by the server, measured in chunks in each direction of the player (radius, not diameter). If entities are outside of this radius, then they will not be ticked by the server nor will they be visible to players.10 is the default/recommended. If the player has major lag, this value is recommended to be reduced.",
  "snooper-enabled": "Sets whether the server sends snoop data regularly to http://snoop.minecraft.net.<br>false - disable snooping.<br>true - enable snooping.",
  "spawn-animals": "Determines if animals can spawn.true - Animals spawn as normal.<br>false - Animals immediately vanish.<br>If the player has major lag, it is recommended to turn this off/set to false.",
  "spawn-monsters": "Determines if monsters can spawn.true - Enabled. Monsters appear at night and in the dark.<br>false - Disabled. No monsters.<br>This setting has no effect if difficulty = 0 (peaceful). If difficulty is not = 0, a monster can still spawn from a monster spawner.<br>If the player has major lag, it is recommended to turn this off/set to false.",
  "spawn-npcs": "Determines whether villagers can spawn.true - Enabled. Villagers spawn.<br>false - Disabled. No villagers.",
  "spawn-protection": "Determines the side length of the square spawn protection area as 2x+1. Setting this to 0 disables the spawn protection. A value of 1 protects a 3×3 square centered on the spawn point. 2 protects 5×5, 3 protects 7×7, etc. This option is not generated on the first server start and appears when the first player joins. If there are no ops set on the server, the spawn protection is disabled automatically as well.",
  "sync-chunk-writes": "Enables synchronous chunk writes.",
  "use-native-transport": "Linux server performance improvements: optimized packet sending/receiving on Linuxtrue - Enabled. Enable Linux packet sending/receiving optimization<br>false - Disabled. Disable Linux packet sending/receiving optimization",
  "view-distance": "Sets the amount of world data the server sends the client, measured in chunks in each direction of the player (radius, not diameter). It determines the server-side viewing distance.10 is the default/recommended. If the player has major lag, this value is recommended to be reduced.",
  "white-list": "Enables a whitelist on the server.With a whitelist enabled, users not on the whitelist cannot connect. Intended for private servers, such as those for real-life friends or strangers carefully selected via an application process, for example.<br><br>false - No white list is used.<br>true - The file whitelist.json is used to generate the white list.<br>Note: Ops are automatically whitelisted, and there is no need to add them to the whitelist."
}